Revit 2027 API
FamilyManager.Parameter(String) Property
Obtains the parameter of this type with a given name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyParameter this[
	string parameterName
] { get; }
Public ReadOnly Property Parameter (
	parameterName As String
) As FamilyParameter
	Get
public:
property FamilyParameter^ Parameter[String^ parameterName] {
	FamilyParameter^ get (String^ parameterName);
}
member Parameter : FamilyParameter with get
Parameters
parameterName String
Property Value
FamilyParameter
Remarks
Returns null if the parameter is not found.
See Also
Reference
FamilyManager Class
Parameter Overload
Autodesk.Revit.DB Namespace